tap "coursier/formulas"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/services"
tap "int128/kubelogin"
tap "jandedobbeleer/oh-my-posh"
tap "michaeleisel/zld"
tap "nikitabobko/tap"
tap "scalacenter/bloop"
brew "act"
brew "bat"
brew "cmake"
brew "direnv"
brew "doctl"
brew "duckdb"
brew "elixir"
brew "eza"
brew "fd"
brew "fzf"
brew "git-delta"
brew "git-lfs"
brew "gleam"
brew "go"
brew "harfbuzz"
brew "helm"
brew "hugo"
brew "jq"
brew "k6"
brew "librdkafka"
brew "kcat"
brew "kubernetes-cli"
brew "llvm"
brew "lua-language-server"
brew "neovim"
brew "node"
brew "pandoc"
brew "parallel"
brew "pinentry-mac"
brew "protobuf"
brew "ripgrep"
brew "stow"
brew "teleport"
brew "tree"
brew "yaml-language-server"
brew "coursier/formulas/coursier"
brew "derailed/k9s/k9s"
brew "int128/kubelogin/kubelogin"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "zoxide"
cask "1password-cli"
cask "aerospace"
cask "google-cloud-sdk"
cask "keycastr"
cask "ngrok"
cask "raycast"
