tap "coursier/formulas"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/services"
tap "int128/kubelogin"
tap "michaeleisel/zld"
tap "scalacenter/bloop"
brew "act"
brew "bat"
brew "cmake"
brew "doctl"
brew "duckdb"
brew "fd"
brew "fzf"
brew "git-delta"
brew "git-lfs"
brew "gnupg"
brew "harfbuzz"
brew "helm"
brew "hugo"
brew "jq"
brew "librdkafka"
brew "kcat"
brew "kubernetes-cli"
brew "llvm"
brew "neovim"
brew "node"
brew "pandoc"
brew "parallel"
brew "pinentry-mac"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "qemu"
brew "ripgrep"
brew "stow"
brew "teleport"
brew "zlib"
brew "coursier/formulas/coursier"
brew "derailed/k9s/k9s"
brew "int128/kubelogin/kubelogin"
cask "dbeaver-community"
cask "google-cloud-sdk"
cask "lens"
cask "neovide"
cask "ngrok"
