tap "conduktor/brew"
tap "coursier/formulas"
tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "scalacenter/bloop"
brew "git-lfs"
brew "gnupg"
brew "harfbuzz"
brew "jq"
brew "librdkafka"
brew "kcat"
brew "kubernetes-cli"
brew "lua-language-server"
brew "neovim"
brew "node"
brew "parallel"
brew "pinentry-mac"
brew "podman"
brew "podman-compose"
brew "python@3.10"
brew "ripgrep"
brew "rust-analyzer"
brew "yaml-language-server"
brew "derailed/k9s/k9s"
cask "amethyst"
cask "conduktor"
